const cities = {
    "서울": ["강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구"],
    "부산": ["부산강서구", "부산금정구", "부산기장군", "부산남구", "부산동구", "부산동래구", "부산진구", "부산북구", "부산사상구", "부산사하구", "부산서구", "부산수영구", "부산연제구", "부산영도구", "부산중구", "부산해운대구"],
    "대구": ["대구남구", "대구달서구", "대구달성군", "대구동구", "대구북구", "대구서구", "대구수성구", "대구중구"],
    "인천": ["인천강화군", "인천계양구", "인천미추홀구", "인천남동구", "인천동구", "인천부평구", "인천서구", "인천연수구", "인천옹진군", "인천중구"],
    "광주": ["광주광산구", "광주남구", "광주동구", "광주북구", "광주서구"],
    "대전": ["대전대덕구", "대전동구", "대전서구", "대전유성구", "대전중구"],
    "울산": ["울산남구", "울산동구", "울산북구", "울산울주군", "울산중구"],
    "세종시": ["세종시"],
    "경기": ["가평군", "고양덕양구", "고양일산동구", "고양일산서구", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시", "동두천시", "부천시","성남수정구", "성남중원구", "성남분당구", "수원장안구", "수원권선구", "수원팔달구", "수원영통구", "시흥시", "안산단원구", "안산상록구", "안성시", "안양만안구", "안양동안구", "양주시", "양평군", "여주시", "연천군", "오산시", "용인처인구", "용인기흥구", "용인수지구", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"],
    "강원": ["강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군", "영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시", "평창군", "홍천군", "화천군", "횡성군"],
    "충북": ["괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "증평군", "진천군", "청주상당구", "청주서원구", "청주흥덕구", "청주청원구", "충주시"],
    "충남": ["계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "연기군", "예산군", "천안시", "청양군", "태안군", "홍성군"],
    "전북": ["고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "전주덕진구", "전주완산구", "정읍시", "진안군"],
    "전남": ["강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군", "영암군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군"],
    "경북": ["경산시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시", "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항남구","포항북구"],
    "경남": ["거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시", "창녕군", "창원의창구", "창원성산구", "창원마산합포구", "창원마산회원구", "창원진해구", "통영시", "하동군", "함안군", "함양군", "합천군"],
    "제주": ["서귀포시", "제주시"]
};

const townships = {
    "서울": {
        "강남구": ["개포동", "논현동", "대치동", "도곡동", "삼성동", "세곡동", "수서동", "신사동", "압구정동", "역삼동", "일원동", "자곡동", "청담동"],
        "강동구": ["강일동", "고덕동", "길동", "둔촌동", "명일동", "상일동", "성내동", "암사동", "천호동"],
        "강북구": ["미아동", "번동", "수유동", "우이동"],
        "강서구": ["가양동", "개화동", "공항동", "과해동", "내발산동", "등촌동", "마곡동", "방화동", "염창동", "오곡동", "오쇠동", "외발산동", "화곡동"],
        "관악구": ["남현동", "봉천동", "신림동"],
        "광진구": ["광장동", "구의동", "군자동", "능동", "자양동", "중곡동", "화양동"],
        "구로구": ["가리봉동", "개봉동", "고척동", "구로동", "궁동", "신도림동", "오류동", "온수동", "천왕동", "항동"],
        "금천구": ["가산동", "독산동", "시흥동"],
        "노원구": ["공릉동", "상계동", "월계동", "중계동", "하계동"],
        "도봉구": ["도봉동", "방학동", "쌍문동", "창동"],
        "동대문구": ["답십리동", "동답동", "신설동", "용두동", "이문동", "장안동", "전농동", "제기동", "청량리동", "회기동", "휘경동"],
        "동작구": ["노량진동", "대방동", "동작동", "본동", "사당동", "상도동", "신대방동", "흑석동"],
        "마포구": ["공덕동", "구수동", "노고산동", "당인동", "대흥동", "도화동", "동교동", "마포동", "망원동", "상수동", "서교동", "성산동", "신공덕동", "신수동", "신정동", "아현동", "연남동", "염리동", "용강동", "중동", "창전동", "토정동", "하중동", "합정동", "현석동"],
        "서대문구": ["남가좌동", "냉천동", "대신동", "대현동", "미근동", "북가좌동", "북아현동", "신촌동", "연희동", "영천동", "창천동", "천연동", "충정로동", "합동", "현저동", "홍은동", "홍제동"],
        "서초구": ["내곡동", "반포동", "방배동", "서초동", "신원동", "양재동", "염곡동", "우면동", "원지동", "잠원동"],
        "성동구": ["금호동1가", "금호동2가", "금호동3가", "금호동4가", "도선동", "마장동", "사근동", "상왕십리동", "성수동1가", "성수동2가", "송정동", "옥수동", "용답동", "왕십리동", "행당동", "홍익동"],
        "성북구": ["길음동", "돈암동", "동선동1가", "동선동2가", "동선동3가", "동선동4가", "동선동5가", "동소문동1가", "동소문동2가", "동소문동3가", "동소문동4가", "동소문동5가", "동소문동6가", "동소문동7가", "보문동1가", "보문동2가", "보문동3가", "보문동4가", "보문동5가", "보문동6가", "삼선동1가", "삼선동2가", "삼선동3가", "삼선동4가", "삼선동5가", "상월곡동", "석관동", "성북동", "성북동1가", "안암동1가", "안암동2가", "안암동3가", "안암동4가", "안암동5가", "장위동", "정릉동", "종암동", "하월곡동"],
        "송파구": ["가락동", "거여동", "마천동", "문정동", "방이동", "삼전동", "석촌동", "송파동", "신천동", "오금동", "위례동", "잠실동", "장지동", "풍납동"],
        "양천구": ["목동", "신월동", "신정동"],
        "영등포구": ["당산동1가", "당산동2가", "당산동3가", "당산동4가", "당산동5가", "당산동6가", "대림동", "도림동", "문래동1가", "문래동2가", "문래동3가", "문래동4가", "문래동5가", "문래동6가", "신길동", "양평동1가", "양평동2가", "양평동3가", "양평동4가", "양평동5가", "양평동6가", "양화동", "여의도동", "영등포동", "영등포동1가", "영등포동2가", "영등포동3가", "영등포동4가", "영등포동5가", "영등포동6가", "영등포동7가", "영등포동8가"],
        "용산구": ["갈월동", "남영동", "도원동", "동빙고동", "동자동", "문배동", "보광동", "산천동", "서빙고동", "신계동", "신창동", "용문동", "용산동2가", "용산동3가", "용산동4가", "용산동5가", "용산동6가", "원효로1가", "원효로2가", "원효로3가", "원효로4가", "이촌동", "이태원동", "주성동", "청암동", "한강로1가", "한강로2가", "한강로3가", "한남동", "효창동", "후암동"],
        "은평구": ["갈현동", "구산동", "녹번동", "대조동", "불광동", "수색동", "신사동", "역촌동", "응암동", "증산동", "진관동"],
        "종로구": ["가회동", "견지동", "경운동", "계동", "공평동", "관수동", "관철동", "관훈동", "교남동", "교북동", "구기동", "궁정동", "권농동", "낙원동", "내수동", "내자동", "누상동", "누하동", "당주동", "도렴동", "돈의동", "동숭동", "명륜1가", "명륜2가", "명륜3가", "명륜4가", "묘동", "무악동", "봉익동", "부암동", "사간동", "사직동", "삼청동", "서린동", "세종로", "소격동", "송월동", "수송동", "숭인동", "신교동", "신문로1가", "신문로2가", "신영동", "안국동", "연건동", "연지동", "예지동", "옥인동", "와룡동", "운니동", "원남동", "원서동", "이화동", "익선동", "인사동", "인의동", "장사동", "재동", "종로1가", "종로2가", "종로3가", "종로4가", "종로5가", "종로6가", "중학동", "창성동", "창신동", "청운동", "청진동", "충신동", "통의동", "통인동", "팔판동", "평동", "평창동", "필운동", "행촌동", "혜화동", "홍지동", "홍파동", "화동", "효자동", "효제동", "훈정동"],
        "중구": ["광희동1가", "광희동2가", "남대문로1가", "남대문로2가", "남대문로3가", "남대문로4가", "남대문로5가", "남산동1가", "남산동2가", "남산동3가", "남창동", "남학동", "다동", "만리동1가", "만리동2가", "명동1가", "명동2가", "무교동", "무학동", "묵정동", "방산동", "봉래동1가", "봉래동2가", "북창동", "산림동", "삼각동", "서소문동", "소공동", "수표동", "수하동", "순화동", "신당동", "쌍림동", "예관동", "예장동", "오장동", "을지로1가", "을지로2가", "을지로3가", "을지로4가", "을지로5가", "을지로6가", "을지로7가", "의주로1가", "의주로2가", "인현동1가", "인현동2가", "입정동", "장교동", "장충동1가", "장충동2가", "저동1가", "저동2가", "정동", "주교동", "주자동", "중림동", "초동", "충무로1가", "충무로2가", "충무로3가", "충무로4가", "충무로5가", "충정로1가", "충정로2가", "충정로3가", "태평로1가", "태평로2가", "필동1가", "필동2가", "필동3가", "황학동", "회현동1가", "회현동2가", "회현동3가", "흥인동"],
        "중랑구": ["망우동", "망우본동", "면목동", "면목본동", "묵동", "상봉동", "신내동", "중화동"]
    },
    "부산": {
        "부산강서구": ["대저동", "강동동", "명지동", "죽림동", "가락동", "녹산동", "생곡동", "구랑동", "지사동", "미음동", "범방동", "신호동", "동선동", "송정동", "화전동", "죽동동", "식만동"],
        "부산금정구": ["구서동", "금사동", "남산동", "부곡동", "서동", "선동", "청룡노포동", "장전동"],
        "부산기장군": ["기장읍", "장안읍", "정관읍", "일광읍", "철마면"],
        "부산남구": ["감만동", "대연동", "문현동", "용당동", "우암동", "용호동"],
        "부산동구": ["초량동", "수정동", "좌천동", "범일동"],
        "부산동래구": ["낙민동", "명륜동", "복산동", "명장동", "안락동", "사직동", "온천동", "수민동"],
        "부산진구": ["부전동", "연지동", "초읍동", "양정동", "전포동", "부암동", "당감동", "가야동", "개금동", "범천동"],
        "부산북구": ["구포동", "금곡동", "덕천동", "만덕동", "화명동"],
        "부산사상구": ["감전동", "괘법동", "덕포동", "모라동", "삼락동", "엄궁동", "주례동", "학장동", "엄궁동"],
        "부산사하구": ["감천동", "괴정동", "구평동", "다대동", "당리동", "신평동", "장림동", "하단동", "신평동"],
        "부산서구": ["동대신동", "서대신동", "부민동", "아미동", "초장동", "충무동", "남부민동", "암남동"],
        "부산수영구": ["남천동", "광안동", "수영동", "민락동"],
        "부산연제구": ["거제동", "연산동"],
        "부산영도구": ["남항동", "동삼동", "봉래동", "신선동", "영선동", "청학동"],
        "부산중구": ["남포동", "동광동", "보수동", "부평동", "영주동"],
        "부산해운대구": ["반여동", "반송동", "재송동", "우동", "중동", "송정동"]
    },
    "대구": {
        "대구남구": ["대명동", "봉덕동"],
        "대구달서구": ["감삼동", "도원동", "두류동", "본리동", "상인동", "성당동", "송현동", "용산동", "이곡동", "장기동", "죽전동", "진천동", "월성동"],
        "대구달성군": ["가창면", "구지면", "논공읍", "다사읍", "옥포읍", "유가읍", "하빈면", "화원읍", "현풍읍", "비슬면"],
        "대구동구": ["각산동", "검사동", "공산동", "내당동", "도림동", "도장동", "동변동", "매여동", "불로동", "서호동", "신암동", "신서동", "신안동", "안심동", "용계동", "율암동", "율하동", "입석동", "지묘동", "진천동", "평광동", "효목동"],
        "대구북구": ["검단동", "고성동", "관문동", "구암동", "노원동", "대현동", "동변동", "동천동", "산격동", "서변동", "성화동", "수정동", "연경동", "연암동", "읍내동", "조야동", "침산동", "팔달동"],
        "대구서구": ["내당동", "비산동", "상중이동", "이현동", "평리동"],
        "대구수성구": ["범어동", "만촌동", "수성동1가", "수성동2가", "수성동3가", "수성동4가", "시지동", "신매동", "연호동", "이천동", "중동", "파동", "황금동"],
        "대구중구": ["남산동", "대봉동", "대신동", "대안동", "동인동1가", "동인동2가" , "동인동3가", "동인동4가", "명덕동", "봉산동", "삼덕동", "상덕동", "상동", "수창동", "연합동", "왕산동", "이천동", "종로동", "지산동", "청기와동", "태평로3가"]
    },
    "인천": {
        "인천강화군": ["강화읍", "교동면", "길상면", "내가면", "불은면", "삼산면", "서도면", "선원면", "송해면", "양도면", "양사면", "양촌면", "청량면", "하점면", "화도면"],
        "인천계양구": ["계산동", "작전동", "작전서운동", "효성동", "병방동", "임학동", "방축동", "박촌동", "귤현동", "다남동", "동양동"],
        "인천미추홀구": ["숭의동", "용현동", "학익동", "도화동", "주안동", "관교동", "문학동"],
        "인천남동구": ["구월동", "간석동", "남촌도림동", "만수동", "서창동", "장수서창동", "장수동", "논현동", "논현고잔동"],
        "인천동구": ["금창동", "만석동", "송림동", "송현동", "화수동", "화평동"],
        "인천부평구": ["갈산동", "부개동", "부평동", "산곡동", "삼산동", "십정동", "일신동", "청천동"],
        "인천서구": ["가정동", "가좌동", "검암경서동", "공촌동", "불로대곡동", "석남동", "신현원창동", "연희동", "오류왕길동", "원당동", "청라동"],
        "인천연수구": ["동춘동", "선학동", "송도동", "연수동", "옥련동", "청학동"],
        "인천옹진군": ["영흥면", "자월면", "덕적면", "백령면", "대청면", "소청면", "장봉면", "연평면"],
        "인천중구": ["중산동", "운서동", "운남동", "용유동", "을왕동", "남북동", "동인천동", "신포동", "신흥동", "답동", "영종동", "연안동"]
    },
    "광주": {
        "광주광산구": ["도산동", "동곡동", "본량동", "삼도동", "송정동", "신가동", "신창동", "신흥동", "쌍암동", "어룡동", "우산동", "운남동", "월곡동", "임곡동", "첨단동", "평동", "하남동", "흑석동"],
        "광주남구": ["방림동", "봉선동", "사직동", "송암동", "월산동", "주월동", "진월동", "효덕동"],
        "광주동구": ["계림동", "광산동", "남동", "산수동", "서남동", "지산동", "학동", "충장동"],
        "광주북구": ["건국동", "경양동", "고룡동", "두암동", "매곡동", "문흥동", "문화동", "삼각동", "석곡동", "양산동", "연제동", "오치동", "용봉동", "운암동", "일곡동", "임동", "중앙동", "풍향동", "화정동"],
        "광주서구": ["광천동", "금호동", "내방동", "농성동", "덕흥동", "동천동", "상무동", "서창동", "세하동", "송암동", "양동", "유덕동", "치평동", "풍암동"]
    },
    "대전": {
        "대전대덕구": ["법동", "오정동", "신탄진동", "송촌동", "중리동", "석봉동", "회덕동", "비래동"],
        "대전동구": ["가양동", "대동", "대청동", "동사동", "자양동", "정동", "홍도동", "삼성동", "용운동", "용전동", "중앙동", "판암동", "휘경동"],
        "대전서구": ["갈마동", "관저동", "내동", "도마동", "둔산동", "만년동", "변동", "복수동", "상도동", "월평동", "정림동", "탄방동", "용문동"],
        "대전유성구": ["구암동", "관평동", "노은동", "대정동", "도룡동", "봉명동", "상대동", "신성동", "신안동", "안산동", "전민동", "진잠동", "학하동", "온천동"],
        "대전중구": ["대흥동", "목동", "문창동", "문화동", "부사동", "산성동", "석교동", "선화동", "유천동", "용두동", "중촌동", "침산동", "태평동", "흥남동"]
    },
    "울산": {
        "울산남구": ["무거동", "삼산동", "삼호동", "선암동", "수암동", "신정동", "야음장생포동"],
        "울산동구": ["방어동", "서부동", "주전동", "전하동", "남목동", "일산동"],
        "울산북구": ["강동동", "농소동", "매곡동", "송정동", "효문동"],
        "울산울주군": ["두동면", "두서면", "상북면", "삼남읍", "삼동면", "서생면", "언양읍", "온산읍", "온양읍", "웅촌면", "청량읍"],
        "울산중구": ["다운동", "병영동", "복산동", "성안동", "약사동", "우정동", "중앙동", "태화동", "학성동"]
    },
    "세종시": {
        "세종시": ["고운동", "금남면", "대평동", "도담동", "반곡동", "보람동", "부강면", "소담동", "소정면", "아름동", "연기면", "연동면", "연서면", "장군면", "전의면", "전동면", "조치원읍", "종촌동", "한솔동", "해밀동", "합강동"]
    },
    "경기": {
        "가평군": ["가평읍", "설악면", "청평면", "상면", "조종면", "북면"],
        "고양덕양구": ["주교동", "원신동", "흥도동", "성사동", "화정동", "행주동", "행신동", "능곡동", "고양동", "관산동", "화수동", "대덕동", "대화동"],
        "고양일산동구": ["마두동", "백석동", "장항동", "고봉동", "중산동", "풍산동"],
        "고양일산서구": ["일산동", "탄현동", "주엽동", "대화동", "송산동", "송포동", "가좌동"],
        "과천시": ["과천동", "문원동", "부림동", "별양동", "갈현동", "주암동", "중앙동"],
        "광명시": ["광명동", "철산동", "하안동", "소하동", "학온동"],
        "광주시": ["경안동", "송정동", "쌍령동", "탄벌동", "태전동", "중대동", "오포읍", "초월읍", "곤지암읍", "도척면", "퇴촌면", "남종면", "남한산성면"],
        "구리시": ["갈매동", "교문동", "동구동", "수택동", "인창동"],
        "군포시": ["군포동", "금정동", "대야동", "산본동", "재궁동", "오금동", "수리동", "당동", "부곡동"],
        "김포시": ["통진읍", "고촌읍", "양촌읍", "대곶면", "월곶면", "하성면", "김포동", "장기동", "운양동", "구래동", "마산동"],
        "남양주시": ["와부읍", "진접읍", "화도읍", "평내동", "호평동", "금곡동", "양정동", "다산동", "별내동"],
        "동두천시": ["생연동", "중앙동", "불현동", "송내동", "소요동", "상패동"],
        "부천시": ["심곡동", "부천동", "중동", "상동", "송내동", "소사본동", "범박동", "성곡동", "오정동"],
        "성남수정구": ["태평동", "수진동", "단대동", "산성동", "양지동", "복정동", "고등동", "시흥동", "신흥동"],
        "성남중원구": ["성남동", "중앙동", "금광동", "은행동", "상대원동", "하대원동", "도촌동"],
        "성남분당구": ["분당동", "수내동", "정자동", "서현동", "이매동", "야탑동", "판교동", "삼평동", "백현동", "금곡동", "구미동", "동원동"],
        "수원장안구": ["파장동", "율전동", "정자동", "영화동", "송죽동", "조원동", "연무동"],
        "수원권선구": ["세류동", "평동", "서둔동", "구운동", "금곡동", "호매실동", "권선동", "곡선동", "입북동"],
        "수원팔달구": ["매교동", "매산동", "고등동", "화서동", "지동", "우만동", "인계동", "행궁동"],
        "수원영통구": ["매탄동", "원천동", "영통동", "태장동", "망포동"],
        "시흥시": ["대야동", "신천동", "은행동", "매화동", "목감동", "군자동", "월곶동", "정왕동", "배곧동"],
        "안산단원구": ["와동", "고잔동", "중앙동", "호수동", "원곡동", "백운동", "신길동", "초지동", "선부동", "대부동"],
        "안산상록구": ["일동", "이동", "사동", "해양동", "본오동", "부곡동", "월피동", "성포동", "반월동", "안산동"],
        "안성시": ["공도읍", "보개면", "금광면", "서운면", "미양면", "대덕면", "양성면", "원곡면", "일죽면", "죽산면", "삼죽면", "고삼면"],
        "안양만안구": ["안양동", "석수동", "박달동"],
        "안양동안구": ["비산동", "부흥동", "달안동", "관양동", "평촌동", "평안동", "귀인동", "호계동", "범계동", "신촌동", "갈산동"],
        "양주시": ["백석읍", "은현면", "남면", "광적면", "장흥면", "양주동", "회천동"],
        "양평군": ["양평읍", "강상면", "강하면", "양서면", "옥천면", "서종면", "단월면", "청운면", "양동면", "지평면", "용문면", "개군면"],
        "여주시": ["여주읍", "가남읍", "점동면", "흥천면", "금사면", "세종대왕면", "대신면", "강천면", "산북면", "여흥동", "중앙동", "오학동"],
        "연천군": ["연천읍", "전곡읍", "군남면", "청산면", "백학면", "미산면", "왕징면", "신서면", "중면", "장남면"],
        "오산시": ["대원동", "남촌동", "초평동", "청호동", "중앙동", "양산동", "세마동"],
        "용인처인구": ["유방동", "김량장동", "마평동", "삼가동", "역북동", "포곡읍", "모현읍", "이동읍", "남사면", "원삼면", "백암면", "양지면", "중앙동"],
        "용인기흥구": ["구갈동", "신갈동", "영덕동", "상갈동", "하갈동", "서천동", "구성동", "마북동", "보정동", "신봉동", "죽전동", "동백동", "기흥동", "공세동"],
        "용인수지구": ["풍덕천동", "상현동", "성복동", "신봉동", "죽전동", "동천동"],
        "의왕시": ["고천동", "부곡동", "오전동", "왕곡동", "내손동", "청계동"],
        "의정부시": ["의정부동", "호원동", "장암동", "신곡동", "송산동", "자금동", "가능동", "녹양동"],
        "이천시": ["장호원읍", "부발읍", "신둔면", "백사면", "호법면", "마장면", "대월면", "모가면", "설성면", "율면", "창전동", "증포동", "중리동", "관고동"],
        "파주시": ["문산읍", "파주읍", "법원읍", "조리읍", "월롱면", "탄현면", "광탄면", "파평면", "적성면", "군내면", "장단면", "진동면", "진서면", "교하동", "운정동", "금촌동"],
        "평택시": ["팽성읍", "안중읍", "포승읍", "청북읍", "진위면", "서탄면", "고덕면", "오성면", "현덕면", "중앙동", "서정동", "송탄동", "지산동", "송북동", "신장동", "신평동", "원평동", "통복동", "비전동", "용이동"],
        "포천시": ["소흘읍", "군내면", "가산면", "내촌면", "신북면", "창수면", "영중면", "영북면", "운천읍", "화현면", "일동면", "이동면", "신읍동"],
        "하남시": ["천현동", "신장동", "덕풍동", "풍산동", "감북동", "초이동", "위례동", "미사동"],
        "화성시": ["봉담읍", "우정읍", "향남읍", "남양읍", "매송면", "비봉면", "마도면", "송산면", "서신면", "팔탄면", "장안면", "양감면", "정남면", "새솔동", "진안동", "병점동", "반월동", "기배동", "화산동", "동탄동"]
    },
    "강원": {
        "강릉시": ["강남동", "경포동", "교동", "내곡동", "대전동", "명주동", "옥천동", "주문진읍", "성덕동", "홍제동", "강동면", "연곡면", "사천면", "성산면", "왕산면", "구정면", "옥계면", "주문진읍", "도계읍", "정선읍"],
        "고성군": ["간성읍", "거진읍", "현내면", "죽왕면", "토성면", "수동면"],
        "동해시": ["북평동", "천곡동", "송정동", "평릉동", "망상동", "용정동", "삼화동", "나안동", "정량동", "송포동", "교동", "천곡동", "송정동", "북삼동", "동호동"],
        "삼척시": ["교동", "남양동", "도경동", "성남동", "평전동", "신기동", "근덕면", "미로면", "원덕면", "노곡면", "도계읍", "하장면"],
        "속초시": ["교동", "금호동", "노학동", "도문동", "동명동", "설악동", "조양동", "청학동", "청호동", "영랑동"],
        "양구군": ["남면", "동면", "방산면", "수입면", "양구읍", "양양읍", "북면", "서면", "손양면", "강현면"],
        "양양군": ["강현면", "양양읍", "서면", "손양면", "현남면", "현북면", "내물치동", "강동면", "남양면"],
        "영월군": ["김삿갓면", "남면", "무릉도원면", "북면", "상동읍", "수주면", "영월읍", "중동면", "주천면", "한반도면"],
        "원주시": ["단구동", "명륜동", "반곡관설동", "봉산동", "소초면", "신림면", "우산동", "원동", "월송동", "인동", "판부면", "호저면", "횡성군", "흥업면", "무실동", "태장동", "학성동", "행구동", "흥업면"],
        "인제군": ["기린면", "남면", "남북면", "북면", "상남면", "서화면", "인제읍", "귀둔리", "이촌리", "서흥리"],
        "정선군": ["고한읍", "신동읍", "안흥면", "여량면", "임계면", "정선읍", "화암면", "임계면", "북면", "고한리", "사북리"],
        "철원군": ["갈말읍", "근동면", "동송읍", "서면", "철원읍", "김화읍", "근남면", "임남면"],
        "춘천시": ["강남동", "교동", "낙원동", "동내면", "동면", "동산면", "사북면", "서면", "신동", "신북읍", "우두동", "후평동", "퇴계동"],
        "태백시": ["구문소동", "삼수동", "상장동", "철암동", "황지동", "황연동", "남면", "북면", "문곡소도동"],
        "평창군": ["대관령면", "도암면", "미탄면", "방림면", "봉평면", "용평면", "진부면", "평창읍", "대화면", "송동면"],
        "홍천군": ["남면", "내촌면", "두촌면", "서석면", "북방면", "서면", "동면", "화촌면", "내면", "홍천읍"],
        "화천군": ["간동면", "광덕면", "화천읍", "상서면", "하남면"],
        "횡성군": ["강림면", "공근면", "둔내면", "서원면", "안흥면", "우천면", "횡성읍", "청일면", "갑천면"]
    },
    "충북": {
        "괴산군": ["괴산읍", "감물면", "소수면", "불정면", "청천면", "청안면", "장연면", "연풍면", "문광면", "사리면", "이양면", "칠성면", "장척면"],
        "단양군": ["가곡면", "단양읍", "대강면", "매포읍", "어상천면", "영춘면", "적성면", "중화면"],
        "보은군": ["내북면", "마로면", "보은읍", "산외면", "삼승면", "속리산면", "수한면", "장안면", "탄부면", "회남면", "회인면"],
        "영동군": ["영동읍", "황간면", "추풍령면", "학산면", "양산면", "용산면", "매곡면", "상촌면", "양강면", "심천면", "용화면"],
        "옥천군": ["안남면", "안내면", "군서면", "군북면", "이원면", "옥천읍", "청산면", "청성면", "동이면"],
        "음성군": ["감곡면", "금왕읍", "대소면", "맹동면", "삼성면", "생극면", "소이면", "원남면", "음성읍", "원곡면"],
        "제천시": ["금성면", "봉양읍", "백운면", "송학면", "수산면", "영서동", "의림동", "장락동", "청풍면", "덕산면", "화산동", "청전동", "하소동", "중앙동", "남천동"],
        "증평군": ["증평읍", "도안면"],
        "진천군": ["덕산읍", "광혜원면", "초평면", "문백면", "백곡면", "이월면", "진천읍"],
        "청주상당구": ["낭성면", "미원면", "가덕면", "남일면", "문의면", "중앙동", "성안동", "대성동", "영운동", "금천동", "용담동", "용암동"],
        "청주서원구": ["남이면", "현도면", "사직동", "사창동", "모충동", "산남동", "분평동", "수곡동", "성화동", "개신동", "죽림동"],
        "청주흥덕구": ["운천신봉동", "복대동", "가경동", "봉명동", "송정동", "강서동", "옥산면", "오송읍"],
        "청주청원구": ["내수읍", "오근장동", "율량동","사천동", "우암동", "내덕동", "오창읍", "북이면"],
        "충주시": ["주덕읍", "살미면", "수안보면", "신니면", "앙성면", "엄정면", "금가면", "동량면", "산척면", "소태면", "대소원면", "소이읍", "신평면", "충주읍", "칠금동", "용두동", "문화동", "중앙동", "성내동", "호암동", "호암동", "교현동", "달천동", "충원동"]
    },
    "충남": {
        "계룡시": ["금암동", "두마면", "신도안면", "엄사면"],
        "공주시": ["계룡면", "공주읍", "구룡면", "금성동", "노은면", "반포면", "사곡면", "석장면", "신관동", "신풍면", "우성면", "유구읍", "이인면", "장기면", "정안면", "중학동", "탄천면"],
        "금산군": ["금산읍", "군북면", "남일면", "남이면", "남산면", "보석면", "제원면", "진산면", "추부면", "중앙면", "진안면"],
        "논산시": ["가야곡면", "강경읍", "광석면", "노성면", "벌곡면", "부적면", "상월면", "성동면", "양촌면", "연무읍", "은진면", "채운면", "채소면", "황산면", "화지면"],
        "당진시": ["대호지면", "면천면", "송악읍", "신평면", "정미면", "고대면", "석문면", "신시읍", "우강면", "한곡면", "정장면", "부곡면"],
        "보령시": ["남포면", "명천동", "대천동", "미산면", "보령읍", "청라면", "천북면", "천안면", "청소면", "충청면", "화성면"],
        "부여군": ["구룡면", "규암면", "남면", "부여읍", "석성면", "세도면", "양화면", "옥산면", "외산면", "은산면", "장암면", "장축면", "초촌면", "충화면", "청양면", "치성면"],
        "서산시": ["부춘동", "동문동", "석림동", "수석동", "인지면", "대산읍", "지곡면", "성연면", "팔봉면", "지곡면", "운산면", "동문동", "대산읍", "읍내동"],
        "서천군": ["서천읍", "마산면", "종천면", "장항읍", "비인면", "서면", "화양면", "한산면", "문산면", "시천면", "판교면"],
        "아산시": ["도고면", "둔포면", "배방읍", "선장면", "송악면", "염치읍", "영인면", "온양동", "읍내동", "배방읍", "법화동", "선장면"],
        "연기군": ["고복리", "기산리", "남면", "동면", "부강면", "서면", "소정면", "신도시1동", "신도시2동", "연서면", "연기면", "조치원읍"],
        "예산군": ["대술면", "덕산면", "봉산면", "삽교읍", "신양면", "예산읍", "오가면", "광시면", "대흥면", "고덕면", "성거읍", "덕산면"],
        "천안시": ["광덕면", "목천읍", "병천면", "불당동", "부성동", "백석동", "불당동", "성남면", "성거읍", "수신면", "신방동", "신부동", "쌍용동", "성황동", "청룡동"],
        "청양군": ["고운동", "남양면", "대전면", "비봉면", "목면", "비봉면", "정산면", "장평면", "청양읍", "화성면", "장평면"],
        "태안군": ["고남면", "남면", "안면읍", "소원면", "이원면", "태안읍", "근흥면", "원북면", "판교면", "청산면"],
        "홍성군": ["결성면", "갈산면", "광천읍", "구항면", "금마면", "서부면", "은하면", "홍북면", "홍성읍", "금광면", "금산면"]
    },
    "전북": {
        "고창군": ["고창읍", "공음면", "무장면", "부안면", "상하면", "성내면", "신림면", "아산면", "안곡면", "해리면", "흥덕면"],
        "군산시": ["개정동", "개정면", "개정읍", "경암동", "경장동", "구암동", "나운동", "대야면", "도개동", "서흥남동", "미성동", "비응도동", "소룡동", "신흥동", "옥구읍", "옥산면", "옥서면", "옥봉동", "월명동", "월항동", "임피면", "지곡동",],
        "김제시": ["검산동", "금구면", "금산면", "광활면", "교동", "남성동", "대광동", "덕암동", "만경읍", "백산면", "백학동", "봉남면", "부량면", "부회동", "상동", "서공동", "서흥동", "성덕면", "신풍동", "신흥동", "신풍동", "여의동", "영동", "오정동", "요촌동", "용동", "월봉동", "월촌동", "원평면", "장척동", "죽산면", "진봉면", "청하면", "하동", "황산면"],
        "남원시": ["금지면", "덕과면", "도통동", "동충동", "산내면", "산동면", "삼봉동", "수지면", "식정동", "쌍교동", "아영면", "왕정동", "운봉읍", "월락동", "이백면", "인월면", "주촌동", "주생면", "중앙동", "천거동", "하정동", "하림동", "함파우동", "향교동", "현동", "화정동", "황산면"],
        "무주군": ["무주읍", "무풍면", "설천면", "안성면", "적상면", "부남면"],
        "부안군": ["보안면", "변산면", "부안읍", "백산면", "줄포면", "주산면", "하서면", "행안면", "진서면", "동진면", "계화면"],
        "순창군": ["구림면", "금과면", "동계면", "순창읍", "적성면", "팔덕면", "복흥면", "쌍치면", "인계면", "풍산면"],
        "완주군": ["고산면", "봉동읍", "삼례읍", "상관면", "소양면", "용진읍", "운주면", "이서면", "화산면", "경천면", "동상면"],
        "익산시": ["갈산동", "금마면", "동산동", "마동", "모현동", "삼기면", "삼성동", "석탄동", "송학동", "신동", "신흥동", "어양동", "영등동", "용동면", "용안면", "용제동", "육암동", "인화동", "중앙동", "창인동", "팔봉동", "평화동", "함열읍", "함열면", "황등면"],
        "임실군": ["관촌면", "강진면", "덕치면", "신평면", "운암면", "임실읍", "성수면", "삼계면", "오수면", "지사면", "신덕면"],
        "장수군": ["계남면", "계북면", "번암면", "장수읍", "장계면", "천천면", "장계면"],
        "전주덕진구": ["진북동", "인후동1가", "인후동2가", "덕진동1가", "덕진동2가", "금암동", "팔복동1가", "팔복동2가", "팔복동3가", "산정동", "금상동", "우아동1가", "우아동2가", "우아동3가", "호성동1가", "호성동2가", "호성동3가", "전미동1가", "전미동2가", "송천동1가", "송천동2가", "반월동", "화전동", "용정동", "성덕동", "원동", "고랑동", "여의동", "만성동", "장동", "팔복동4가", "도도동", "강흥동", "도덕동", "남정동", "중동", "여의동2가"],
        "전주완산구": ["중앙동", "풍남동", "노송동", "완산동", "동서학동", "서서학동", "중화산동", "서신동", "평화동", "삼천동", "효자동1가", "효자동2가", "효자동3가", "효자동4가"],
        "정읍시": ["감곡면", "고부면", "농소동", "내장동", "농소동", "덕천면", "망제동", "북면", "부전동", "소성면", "송산동", "수성동", "신태인읍", "쌍암동", "영파동", "옹동면", "입암면", "장명동", "정우면", "초산동", "태인면", "하북동", "혁신동", "학산동", "황토현동", "호남동", "흥남동", "화호동"],
        "진안군": ["동향면", "백운면", "상전면", "성수면", "안천면", "용담면", "주천면", "진안읍", "부귀면"]
    },
    "전남": {
        "강진군": ["강진읍", "군동면", "도암면", "마량면", "병영면", "성전면", "신전면", "옴천면", "작천면", "칠량면", "대구면"],
        "고흥군": ["고흥읍", "과역면", "금산면", "남양면", "대서면", "도덕면", "도양읍", "동강면", "두원면", "도화면", "봉래면", "보성읍", "세종면", "신양면", "영남면", "영천면", "점암면", "포두면", "화전면"],
        "곡성군": ["곡성읍", "겸면", "고달면", "옥과면", "오산면", "삼기면", "석곡면", "입면", "죽곡면", "삼기면", "옥과면"],
        "광양시": ["광양읍", "골약동", "금호동", "다압면", "도이동", "동림동", "마동", "봉강면", "서내동", "성황동", "중동", "진월면", "태인동", "옥곡면", "옥룡면", "용강동", "읍내동", "중마동"],
        "구례군": ["구례읍", "간전면", "광의면", "마산면", "문척면", "산동면", "용방면", "토지면"],
        "나주시": ["나주읍", "금천면", "다시면", "다시읍", "노안면", "봉황면", "산포면", "세지면", "왕곡면", "운암동", "동강면", "영산포동", "오량동", "금성동"],
        "담양군": ["가사문학면", "고서면", "대덕면", "대전면", "담양읍", "무정면", "봉산면", "수북면", "용면", "월산면", "창평면", "천변면", "학동면"],
        "목포시": ["광동동", "대양동", "대성동", "만호동", "명륜동", "부흥동", "부주동", "상동", "삼향동", "상남동", "서산동", "신외동", "연동", "옥암동", "온금동", "용해동", "운암동", "유달동", "죽교동", "평화동", "하당동", "항동", "현동", "해안동", "호남동"],
        "무안군": ["망운면", "무안읍", "무안면", "청계면", "삼향면", "현경면", "운남면", "일로읍", "해제면"],
        "보성군": ["겸백면", "노동면", "미력면", "벌교읍", "복내면", "보성읍", "문덕면", "율어면", "조성면", "천부면", "회천면"],
        "순천시": ["덕연동", "향동", "매곡동", "삼산동", "저전동", "인제동", "도사동", "풍덕동", "서면", "조곡동", "왕지동", "주암면", "승주읍", "낙안면", "향동", "외서면"],
        "신안군": ["도초면", "비금면", "신의면", "임자면", "지도읍", "자은면", "장산면", "하의면", "흑산면", "안좌면"],
        "여수시": ["여서동", "문수동", "서강동", "선원동", "광림동", "국동", "충무동", "동문동", "한려동", "쌍봉동", "중앙동", "대교동", "화정면", "율촌면", "삼일동", "만덕동", "상암동", "경호동", "삼일동"],
        "영광군": ["백수읍", "법성면", "군남면", "불갑면", "묘량면", "홍농읍", "염산면", "영광읍", "염계면"],
        "영암군": ["도포면", "미암면", "삼호읍", "서호면", "시종면", "신북면", "영암읍", "덕진면", "금정면"],
        "완도군": ["금일읍", "신지면", "약산면", "완도읍", "청산면", "소안면", "보길면", "금당면"],
        "장성군": ["진원면", "남면", "삼계면", "장성읍", "북일면", "서삼면", "황룡면", "북이면"],
        "장흥군": ["관산읍", "대덕면", "장흥읍", "안양면", "용산면", "유치면", "회진면"],
        "진도군": ["의신면", "진도읍", "군내면", "고군면", "임회면", "조도면", "지산면"],
        "함평군": ["대동면", "나산면", "학교면", "함평읍", "손불면", "신광면", "월야면", "해보면"],
        "해남군": ["옥천면", "해남읍", "현산면", "송지면", "화산면", "현천면"],
        "화순군": ["동면", "도곡면", "능주면", "이양면", "청풍면", "화순읍", "한천면"]
    },
    "경북": {
        "경산시": ["중방동", "서부동", "서부동", "동부동", "남부동", "중앙동", "남산면", "하양읍", "자인면", "진량읍", "압량읍", "와촌면", "남천면"],
        "경주시": ["감포읍", "강동면", "건천읍", "내남면", "동천동", "보덕동", "불국동", "서부동", "양남면", "양북면", "외동읍", "용강동", "월성동", "황남동", "황성동", "현곡면", "안강읍", "서면", "선도동"],
        "고령군": ["고령읍", "개진면", "다산면", "대가야읍", "덕곡면", "성산면", "운수면", "우곡면", "쌍림면"],
        "구미시": ["고아읍", "공단동", "광평동", "구포동", "구평동", "도개면", "도량동", "무을면", "봉곡동", "부곡동", "비산동", "사곡동", "산동면", "상모사곡동", "선기동", "선산읍", "송정동", "신평동", "양포동", "옥계동", "임은동", "임수동", "지산동", "진미동", "형곡동", "황상동", "황성동", "황오동"],
        "군위군": ["고로면", "군위읍", "부계면", "삼국동", "소보면", "영천동", "의흥면", "효령면"],
        "김천시": ["감문면", "감천면", "개령면", "구성면", "교동", "남면", "남산동", "대곡동", "대덕면", "덕곡동", "봉산면", "부곡동", "삼락동", "성내동", "아포읍", "안산동", "양천동", "용두동", "율곡동", "율세동", "지좌동", "조마면", "지례면", "진수동", "직지사동", "추풍령면"],
        "문경시": ["가은읍", "동로면", "문경읍", "영순면", "마성면", "산북면", "산양면", "영순면", "점촌동", "호계면"],
        "봉화군": ["명호면", "법전면", "봉화읍", "봉성면", "상운면", "석포면", "소천면", "춘양면", "재산면"],
        "상주시": ["남원동", "낙동면", "남장동", "북문동", "북문면", "서남동", "동문동", "서남동", "모서면", "모동면", "성동면", "함창읍", "화서면"],
        "성주군": ["가천면", "금수면", "대가면", "벽진면", "성주읍", "수륜면", "용암면", "월항면", "초전면"],
        "안동시": ["강남동", "강서동", "길안면", "남후면", "남선면", "남부동", "노하동", "농소면", "북문동", "북문면", "북부동", "서부동", "송현동", "신안동", "안기동", "안막동", "안동읍", "옥동", "와룡면", "용상동", "운암동", "율세동", "중앙동"],
        "영덕군": ["강구면", "남정면", "달산면", "영덕읍", "지품면", "창수면"],
        "영양군": ["영양읍", "석보면", "청기면", "입암면", "일월면"],
        "영주시": ["가흥동", "문수면", "봉산면", "사천면", "상망동", "하망동", "이산면", "영주동", "풍기읍", "휴천동"],
        "영천시": ["금호읍", "대창면", "도동", "신녕면", "신림면", "안동읍", "영천동", "임고면", "화북면", "화산면", "화천동"],
        "예천군": ["감천면", "개포면", "보문면", "예천읍", "용궁면", "유천면", "은풍면", "지보면", "풍양면", "호명면"],
        "울릉군": ["서면", "북면", "남면", "울릉읍"],
        "울진군": ["기성면", "근남면", "금강송면", "울진읍", "온정면", "평해읍", "후포읍"],
        "의성군": ["가음면", "금성면", "봉양면", "의성읍", "단촌면", "다인면", "비안면", "사곡면", "안계면", "안사면"],
        "청도군": ["각남면", "각북면", "금천면", "청도읍", "풍각면", "화양읍"],
        "청송군": ["부남면", "진보면", "청송읍", "파천면", "현동면", "현서면"],
        "칠곡군": ["가산면", "기산면", "동명면", "석적읍", "약목면", "왜관읍", "지천면", "읍내면"],
        "포항남구": ["구룡포읍", "연일읍", "오천읍", "대송면", "동해면", "상대동", "송도동", "연일읍", "원산동", "일월동", "인덕동", "장기면", "장흥동", "청림동", "효자동", "해도동"],
        "포항북구": ["기계면", "기북면", "흥해읍", "신광면", "청하면", "송라면", "죽장면", "대보면", "양덕동", "죽도동", "환여동", "학산동", "장량동", "죽장면", "신흥동", "두호동", "우창동", "장성동", "득량동", "용흥동"]
    },
    "경남": {
        "거제시": ["거제면", "고현동", "남부면", "능포동", "둔덕면", "동부면", "사등면", "사등면", "수양동", "아주동", "연초면", "옥포동", "장목면", "장평동", "하청면", "일운면", "장승포동"],
        "거창군": ["가조면", "가북면", "거창읍", "고제면", "남상면", "남하면", "마리면", "북상면", "신원면", "웅양면", "주상면", "위천면"],
        "고성군": ["거류면", "고성읍", "구만면", "대가면", "동해면", "마암면", "삼산면", "영오면", "영현면", "하일면", "하이면", "회화면"],
        "김해시": ["강서동", "관동동", "부원동", "삼안동", "장유동", "불암동", "회현동", "삼방동", "대동면", "생림면", "주촌면", "진영읍", "진례면", "내동", "동상동", "불암동", "외동"],
        "남해군": ["가시리", "가시면", "고현면", "남해읍", "삼동면", "상주면", "서면", "설천면", "이동면", "남면", "창선면"],
        "밀양시": ["교동", "내이동", "삼문동", "삼문동", "삼랑진읍", "산외면", "부북면", "청도면", "초동면", "하남읍"],
        "사천시": ["벌리동", "동금동", "서금동", "동금동", "향촌동", "벌리동", "신부동", "벌리동", "삼천포", "곤양면"],
        "산청군": ["산청읍", "안주면", "금서면", "신안면", "오부면", "차황면", "생초면", "신등면", "삼장면", "금곡면", "신등면", "생초면", "오부면"],
        "양산시": ["물금읍", "양산동", "중앙동", "서창동", "남부동", "하북면", "삼호동", "명동", "대석동", "평산동", "원동면", "덕계동"],
        "의령군": ["가례면", "궁류면", "대의면", "낙서면", "내리면", "봉수면", "부림면", "용덕면", "유곡면", "칠곡면", "의령읍"],
        "진주시": ["가좌동", "강남동", "강동면", "금산면", "대곡면", "명석면", "문산읍", "미천면", "상봉동", "상평동", "상대동", "상봉동", "수곡면", "신안동", "아양동", "이현동", "중앙동", "초장동", "충무공동", "평거동", "판문동", "하대동", "호탄동"],
        "창녕군": ["계성면", "고암면", "길곡면", "남지읍", "대지면", "도천면", "부곡면", "성산면", "영산면", "유어면", "이방면", "장마면", "창녕읍"],
        "창원의창구": ["동읍", "북면", "대산면", "의창동", "팔룡동", "명곡동", "봉림동"],
        "창원성산구": ["반송동", "용지동", "중앙동", "상남동", "사파동", "가음정동", "성주동", "웅남동"],
        "창원마산합포구": ["구산면", "진동면", "진북면", "진전면", "현동", "가포동", "월영동", "문화동", "반월중앙동", "완월동", "자산동", "교방동", "오동동", "합포동", "산호동"],
        "창원마산회원구": ["내서읍", "회원동", "석전동", "회성동", "양덕동", "합성동", "구암동", "봉암동"],
        "창원진해구": ["충무동", "여좌동", "태백동", "경화동", "병암동", "석동", "이동", "자은동", "덕산동", "풍호동", "웅천동", "마천동"],
        "통영시": ["광도면", "도산면", "명정동", "무전동", "미수동", "봉평동", "산양읍", "서호동", "욕지면", "용남면", "정량동", "중앙동", "한산면", "태평동"],
        "하동군": ["고전면", "금남면", "금성면", "북천면", "양보면", "옥종면", "하동읍", "화개면", "횡천면"],
        "함안군": ["가야읍", "대산면", "법수면", "산인면", "여항면", "칠북면", "칠서면", "함안면", "군북면"],
        "함양군": ["마천면", "백전면", "병곡면", "서상면", "안의면", "지곡면", "함양읍"],
        "합천군": ["가야면", "대병면", "대양면", "묘산면", "삼가면", "쌍백면", "초계면", "합천읍", "율곡면", "가회면"]
    },
    "제주": {
        "서귀포시": ["대정읍", "남원읍", "성산읍", "안덕면", "표선면", "중문동", "예래동", "영천동", "송산동", "서홍동", "서귀동", "동홍동", "천지동", "효돈동", "신효동", "정방동", "중앙동"],
        "제주시": ["구좌읍", "남원읍", "대정읍", "애월읍", "우도면", "조천읍", "한경면", "한림읍", "용담동", "삼도동", "일도동", "이도동", "건입동", "노형동", "오라동", "연동", "이호동", "외도동", "도두동"]
    }
};

const coords = {
    '서울': [37.5665, 126.9780],
    '부산': [35.1796, 129.0756],
    '대구': [35.8722, 128.6017],
    '인천': [37.4563, 126.7052],
    '광주': [35.1595, 126.8526],
    '대전': [36.3504, 127.3845],
    '울산': [35.5384, 129.3114],
    '세종': [36.4803, 127.2899],
    '경기': [37.4138, 127.5183],
    '강원': [37.8228, 128.1555],
    '충북': [36.6357, 127.4914],
    '충남': [36.5184, 126.8005],
    '전북': [35.8201, 127.1088],
    '전남': [34.8679, 126.991],
    '경북': [36.4919, 128.8889],
    '경남': [35.4606, 128.2132],
    '제주': [33.4996, 126.5312]
};

let hospitalData = [];
let map = null;


function fetchHospitalData() {
    fetch('data/hospital_data.json')
        .then(response => response.json())
        .then(data => {
            hospitalData = data;
        })
        .catch(error => {
            console.error('Error fetching hospital data:', error);
        });
}

function loadCities() {
    const provinceSelect = document.getElementById('province');
    const citySelect = document.getElementById('city');
    const townshipSelect = document.getElementById('township');

    const selectedProvince = provinceSelect.value;

    citySelect.innerHTML = '<option value="">시/군/구</option>';
    townshipSelect.innerHTML = '<option value="">읍/면/동</option>';

    if (selectedProvince) {
        const cityList = cities[selectedProvince];
        cityList.forEach(city => {
            const option = document.createElement('option');
            option.value = city;
            option.textContent = city;
            citySelect.appendChild(option);
        });
    }
}

function loadTownships() {
    const citySelect = document.getElementById('city');
    const townshipSelect = document.getElementById('township');

    const selectedCity = citySelect.value;
    const selectedProvince = document.getElementById('province').value;

    townshipSelect.innerHTML = '<option value="">읍/면/동</option>';

    if (selectedCity && townships[selectedProvince] && townships[selectedProvince][selectedCity]) {
        const townshipList = townships[selectedProvince][selectedCity];
        townshipList.forEach(township => {
            const option = document.createElement('option');
            option.value = township;
            option.textContent = township;
            townshipSelect.appendChild(option);
        });
    }
}

function confirmSelection() {
    const provinceSelect = document.getElementById('province');
    const citySelect = document.getElementById('city');
    const townshipSelect = document.getElementById('township');

    const selectedProvince = provinceSelect.value;
    const selectedCity = citySelect.value;
    const selectedTownship = townshipSelect.value;

    if (selectedProvince && selectedCity && selectedTownship) {
        displayHospitalList(selectedProvince, selectedCity, selectedTownship);
        updateMapByLocation(selectedProvince);
    }
}

function displayHospitalList(province, city, township) {
    const hospitalList = document.getElementById('hospital-list');
    hospitalList.innerHTML = '';

    const filteredHospitals = hospitalData.filter(hospital => hospital['시/도'] === province && hospital['시/군/구'] === city && hospital['읍/면/동'] === township);

    filteredHospitals.forEach(hospital => {
        const hospitalItem = document.createElement('div');
        hospitalItem.className = 'hospital-item';
        hospitalItem.innerHTML = `
            <div class="hospital-info">
                <h3>${hospital['요양기관명']}</h3>
                <div class="info-row">
                    <span class="info-title">병원구분</span>
                    <span class="info-content">${hospital['병원구분']}</span>
                </div>
                <div class="info-row">
                    <span class="info-title">대표전화</span>
                    <span class="info-content">${hospital['전화번호']}</span>
                </div>
                <div class="info-row">
                    <span class="info-title">주소</span>
                    <span class="info-content">${hospital['주소']}</span>
                </div>
                <div class="buttons-row">
                    <a href="#" class="map-button" onclick="updateMap(${hospital['좌표(X)']}, ${hospital['좌표(Y)']})">지도보기</a>
                    <a href="${hospital['병원홈페이지']}" class="copy-info-button" target="_blank">병원정보 보기</a>
                </div>
            </div>
        `;
        hospitalList.appendChild(hospitalItem);
    });
}

function updateMap(x, y) {
    const latLng = new naver.maps.LatLng(y, x);
    map.setCenter(latLng);
    new naver.maps.Marker({
        position: latLng,
        map: map
    });
}

function updateMapByLocation(province) {
    const center = coords[province] || [37.5665, 126.9780]; // 기본값으로 서울의 좌표 사용
    updateMap(center[1], center[0]);
}

function cancelSelection() {
    document.getElementById('province').value = "";
    document.getElementById('city').innerHTML = '<option value="">시/군/구</option>';
    document.getElementById('township').innerHTML = '<option value="">읍/면/동</option>';
    document.getElementById('hospital-list').innerHTML = '';
}

document.addEventListener('DOMContentLoaded', () => {
    fetchHospitalData();
    // 네이버 지도를 초기화합니다.
    map = new naver.maps.Map('map', {
        center: new naver.maps.LatLng(37.5665, 126.9780),
        zoom: 14
    });
});